Repository: Steve-Mee/project-management-app
Catalog: lib/l10n/app_*.arb
Languages: fr, hi

# appTitle
source: Project Management App
fr: Application de gestion de projet
hi: प्रोजेक्ट प्रबंधन ऐप

# loginTitle
source: Sign in
fr: Connexion
hi: लॉगिन

# menuLabel
source: Menu
hi: मेनू

# usernameLabel
source: Username
fr: Nom d'utilisateur
hi: यूज़रनेम

# passwordLabel
source: Password
fr: Mot de passe
hi: पासवर्ड

# loginButton
source: Sign in
fr: Se connecter
hi: लॉगिन

source: Create account
fr: Creer un compte
hi: खाता बनाएं

# logoutTooltip
source: Sign out
fr: Se deconnecter
hi: लॉगआउट

# closeAppTooltip
source: Close app
fr: Fermer l'application
hi: ऐप बंद करें

# settingsTitle
source: Settings
fr: Parametres
hi: सेटिंग्स

# settingsDisplaySection
source: Display
fr: Affichage
hi: डिस्प्ले

# settingsDarkModeTitle
source: Dark mode
fr: Mode sombre
hi: डार्क मोड

# settingsDarkModeSubtitle
source: Switch between light and dark
fr: Basculer entre clair et sombre
hi: लाइट और डार्क में बदलें

# settingsFollowSystemTitle
source: Follow system theme
fr: Suivre le theme du systeme
hi: सिस्टम थीम का पालन करें

# settingsFollowSystemSubtitle
source: Use your device theme
fr: Utiliser le theme de l'appareil
hi: डिवाइस थीम का उपयोग करें

# settingsLanguageTitle
source: Language
fr: Langue
hi: भाषा

# settingsLanguageSubtitle
source: Choose the app language
fr: Choisir la langue de l'application
hi: ऐप की भाषा चुनें

# settingsNotificationsSection
source: Notifications
hi: सूचनाएं

# settingsNotificationsTitle
source: Notifications
hi: सूचनाएं

# settingsNotificationsSubtitle
source: Updates and reminders
fr: Mises a jour et rappels
hi: अपडेट और रिमाइंडर

# settingsPrivacySection
source: Privacy
fr: Confidentialite
hi: गोपनीयता

# settingsLocalFilesConsentTitle
source: Local file permission
fr: Autorisation de fichiers locaux
hi: लोकल फाइल अनुमति

# settingsLocalFilesConsentSubtitle
source: Allow the app to read local project files for AI context.
fr: Autoriser l'application a lire les fichiers locaux du projet pour le contexte IA.
hi: AI संदर्भ के लिए ऐप को लोकल प्रोजेक्ट फाइलें पढ़ने की अनुमति दें।

# settingsUseProjectFilesTitle
source: Use project files
fr: Utiliser les fichiers du projet
hi: प्रोजेक्ट फाइलें उपयोग करें

# settingsUseProjectFilesSubtitle
source: Add local files to AI prompts
fr: Ajouter des fichiers locaux aux invites IA
hi: लोकल फाइलें AI प्रॉम्प्ट में जोड़ें

# settingsProjectsSection
source: Projects
fr: Projets
hi: प्रोजेक्ट

# settingsLogoutTitle
source: Sign out
fr: Se deconnecter
hi: लॉगआउट

# settingsLogoutSubtitle
source: End your current session
fr: Mettre fin a la session actuelle
hi: वर्तमान सत्र समाप्त करें

# settingsExportTitle
source: Export projects
fr: Exporter les projets
hi: प्रोजेक्ट निर्यात करें

# settingsExportSubtitle
source: Export projects to a file
fr: Exporter les projets vers un fichier
hi: प्रोजेक्ट को फाइल में निर्यात करें

# settingsImportTitle
source: Import projects
fr: Importer des projets
hi: प्रोजेक्ट आयात करें

# settingsImportSubtitle
source: Import projects from a file
fr: Importer des projets depuis un fichier
hi: फाइल से प्रोजेक्ट आयात करें

# settingsUsersSection
source: Users
fr: Utilisateurs
hi: यूज़र

# settingsCurrentUserTitle
source: Current user
fr: Utilisateur actuel
hi: वर्तमान यूज़र

# settingsNotLoggedIn
source: Not signed in
fr: Non connecte
hi: लॉगिन नहीं है

# settingsNoUsersFound
source: No users found.
fr: Aucun utilisateur trouve.
hi: कोई यूज़र नहीं मिला।

# settingsLocalUserLabel
source: Local user
fr: Utilisateur local
hi: लोकल यूज़र

# settingsDeleteTooltip
source: Delete
fr: Supprimer
hi: हटाएं

# settingsLoadUsersFailed
source: Could not load users
fr: Echec du chargement des utilisateurs
hi: यूज़र लोड नहीं हो सके

# settingsAddUserTitle
source: Add user
fr: Ajouter un utilisateur
hi: यूज़र जोड़ें

# settingsAddUserSubtitle
source: Add an extra account
fr: Ajouter un compte supplementaire
hi: एक अतिरिक्त खाता जोड़ें

# logoutDialogTitle
source: Sign out
fr: Se deconnecter
hi: लॉगआउट

# logoutDialogContent
source: Are you sure you want to sign out?
fr: Voulez-vous vraiment vous deconnecter ?
hi: क्या आप लॉगआउट करना चाहते हैं?

# cancelButton
source: Cancel
fr: Annuler
hi: रद्द करें

# logoutButton
source: Sign out
fr: Se deconnecter
hi: लॉगआउट

# loggedOutMessage
source: You have signed out.
fr: Vous avez ete deconnecte.
hi: आप लॉगआउट हो गए हैं।

# exportCompleteMessage
source: Export complete: {projectsPath}, {tasksPath}
fr: Export termine : {projectsPath}, {tasksPath}
hi: निर्यात पूरा: {projectsPath}, {tasksPath}

# exportFailedMessage
source: Export failed: {error}
fr: Echec de l'export : {error}
hi: निर्यात असफल: {error}

# exportPasswordTitle
source: Encrypt export
fr: Chiffrer l'export
hi: एक्सपोर्ट एन्क्रिप्ट करें

# exportPasswordSubtitle
source: Set a password to encrypt the export files.
fr: Definissez un mot de passe pour chiffrer les fichiers d'export.
hi: एक्सपोर्ट फाइलों को एन्क्रिप्ट करने के लिए पासवर्ड सेट करें।

# exportPasswordMismatch
source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.
hi: पासवर्ड मेल नहीं खाते।

# importSelectFilesMessage
source: Select a CSV and JSON file.
fr: Selectionnez un fichier CSV et JSON.
hi: कृपया CSV और JSON फाइल चुनें।

# importCompleteMessage
source: Import complete: {projectsPath}, {tasksPath}
fr: Import termine : {projectsPath}, {tasksPath}
hi: आयात पूरा: {projectsPath}, {tasksPath}

# importFailedMessage
source: Import failed: {error}
fr: Echec de l'import : {error}
hi: आयात असफल: {error}

# importFailedTitle
source: Import failed
fr: Echec de l'import
hi: आयात असफल

# addUserDialogTitle
source: Add user
fr: Ajouter un utilisateur
hi: यूज़र जोड़ें

# saveButton
source: Save
fr: Enregistrer
hi: सेव करें

# userAddedMessage
source: User added.
fr: Utilisateur ajoute.
hi: यूज़र जोड़ा गया।

# invalidUserMessage
source: Invalid user.
fr: Utilisateur invalide.
hi: अमान्य यूज़र।

# deleteUserDialogTitle
source: Delete user
fr: Supprimer l'utilisateur
hi: यूज़र हटाएं

# deleteUserDialogContent
source: Are you sure you want to delete {username}?
fr: Voulez-vous vraiment supprimer {username} ?
hi: क्या आप {username} को हटाना चाहते हैं?

# deleteButton
source: Delete
fr: Supprimer
hi: हटाएं

# userDeletedMessage
source: User deleted: {username}
fr: Utilisateur supprime : {username}
hi: यूज़र हटाया गया: {username}

# projectsTitle
source: Projects
fr: Projets
hi: प्रोजेक्ट

# newProjectButton
source: New project
fr: Nouveau projet
hi: नया प्रोजेक्ट

source: No projects yet
fr: Aucun projet pour l'instant
hi: अभी कोई प्रोजेक्ट नहीं

source: No projects found
fr: Aucun projet trouve
hi: कोई प्रोजेक्ट नहीं मिला

source: Loading more projects...
fr: Chargement de plus de projets...
hi: और प्रोजेक्ट लोड हो रहे हैं...

# sortByLabel
source: Sort by
fr: Trier par
hi: क्रमबद्ध करें

# projectSortName
source: Name
fr: Nom
hi: नाम

# projectSortProgress
source: Progress
fr: Progression
hi: प्रगति

# projectSortPriority
source: Priority
fr: Priorite
hi: प्राथमिकता

# allLabel
source: All
fr: Tous
hi: सभी

# loadProjectsFailed
source: Could not load projects.
fr: Echec du chargement des projets.
hi: प्रोजेक्ट लोड नहीं हो सके।

# projectSemanticsLabel
source: Project {title}
fr: Projet {title}
hi: प्रोजेक्ट {title}

# statusSemanticsLabel
source: Status {status}
fr: Statut {status}
hi: स्थिति {status}

# newProjectDialogTitle
source: New project
fr: Nouveau projet
hi: नया प्रोजेक्ट

# projectNameLabel
source: Project name
fr: Nom du projet
hi: प्रोजेक्ट नाम

# descriptionLabel
source: Description
hi: विवरण

# urgencyLabel
source: Urgency
fr: Urgence
hi: तात्कालिकता

# urgencyLow
source: Low
fr: Basse
hi: कम

# urgencyMedium
source: Medium
fr: Moyenne
hi: मध्यम

# urgencyHigh
source: High
fr: Elevee
hi: उच्च

# projectCreatedMessage
source: Project created: {name}
fr: Projet cree : {name}
hi: प्रोजेक्ट बनाया गया: {name}

# projectDetailsTitle
source: Project details
fr: Details du projet
hi: प्रोजेक्ट विवरण

# aiChatWithProjectFilesTooltip
source: AI chat with project files
fr: Chat IA avec les fichiers du projet
hi: प्रोजेक्ट फाइलों के साथ AI चैट

# moreOptionsLabel
source: More options
fr: Plus d'options
hi: और विकल्प

# tasksTitle
source: Tasks
fr: Taches
hi: कार्य

# tasksTab
source: Tasks
fr: Taches
hi: कार्य

# detailsTab
source: Details
hi: विवरण

# tasksLoadFailed
source: Could not load tasks.
fr: Echec du chargement des taches.
hi: कार्य लोड नहीं हो सके।

# projectOverviewTitle
source: Project overview
fr: Apercu du projet
hi: प्रोजेक्ट अवलोकन

# tasksLoading
source: Loading tasks...
fr: Chargement des taches...
hi: कार्य लोड हो रहे हैं...

# taskStatisticsTitle
source: Task statistics
fr: Statistiques des taches
hi: कार्य सांख्यिकी

# totalLabel
source: Total
hi: कुल

# completedLabel
source: Completed
fr: Terminees
hi: पूरा

# inProgressLabel
source: In progress
fr: En cours
hi: चल रहा

# remainingLabel
source: Remaining
fr: Restantes
hi: शेष

# completionPercentLabel
source: {percent}% complete
fr: {percent}% termine
hi: {percent}% पूरा

# burndownChartTitle
source: Burndown chart
fr: Graphique burndown
hi: बरडाउन चार्ट

# chartPlaceholderTitle
source: Chart placeholder
fr: Espace reserve au graphique
hi: चार्ट प्लेसहोल्डर

# chartPlaceholderSubtitle
source: fl_chart integration coming soon
fr: Integration de fl_chart bientot
hi: fl_chart एकीकरण जल्द आ रहा है

# workflowsTitle
source: Workflows
fr: Flux de travail
hi: वर्कफ़्लो

# noWorkflowsAvailable
source: No workflow items available.
fr: Aucun element de flux disponible.
hi: कोई वर्कफ़्लो आइटम उपलब्ध नहीं।

# taskStatusTodo
source: To do
fr: A faire
hi: करना है

# taskStatusInProgress
source: In progress
fr: En cours
hi: चल रहा

# taskStatusReview
source: Review
fr: Revue
hi: समीक्षा

# taskStatusDone
source: Done
fr: Termine
hi: पूरा

# workflowStatusActive
source: Active
fr: Actif
hi: सक्रिय

# workflowStatusPending
source: Pending
fr: En attente
hi: लंबित

source: No tasks yet
fr: Aucune tache pour l'instant
hi: अभी कोई कार्य नहीं

# projectTimeTitle
source: Project time
fr: Temps du projet
hi: प्रोजेक्ट समय

source: Urgency: {value}
fr: Urgence : {value}
hi: तात्कालिकता: {value}

source: Tracked time: {value}
fr: Temps suivi : {value}
hi: ट्रैक किया गया समय: {value}

# hourShort
source: h
hi: घं

# minuteShort
source: m
fr: min
hi: मि

# secondShort
source: s
hi: से

# searchTasksHint
source: Search tasks...
fr: Rechercher des taches...
hi: कार्य खोजें...

# searchAttachmentsHint
source: Search attachments...
fr: Rechercher des pieces jointes...
hi: अटैचमेंट खोजें...

# clearSearchTooltip
source: Clear search
fr: Effacer la recherche
hi: खोज साफ करें

# projectMapTitle
source: Project folder
fr: Dossier du projet
hi: प्रोजेक्ट फ़ोल्डर

# linkProjectMapButton
source: Link project folder
fr: Lier le dossier du projet
hi: प्रोजेक्ट फ़ोल्डर लिंक करें

# projectDataLoading
source: Loading project data...
fr: Chargement des donnees du projet...
hi: प्रोजेक्ट डेटा लोड हो रहा है...

# projectDataLoadFailed
source: Could not load project data.
fr: Echec du chargement des donnees du projet.
hi: प्रोजेक्ट डेटा लोड नहीं हो सका।

# currentMapLabel
source: Current folder: {path}
fr: Dossier actuel : {path}
hi: वर्तमान फ़ोल्डर: {path}

# noProjectMapLinked
source: No folder linked yet. Link a folder to read files.
fr: Aucun dossier lie. Liez un dossier pour lire les fichiers.
hi: कोई फ़ोल्डर लिंक नहीं है। फ़ाइलें पढ़ने के लिए फ़ोल्डर लिंक करें।

source: Project not available.
fr: Projet non disponible.
hi: प्रोजेक्ट उपलब्ध नहीं है।

# enableConsentInSettings
source: Enable permission in Settings.
fr: Activez l'autorisation dans les parametres.
hi: सेटिंग्स में अनुमति सक्षम करें।

# projectMapLinked
source: Project folder linked.
fr: Dossier du projet lie.
hi: प्रोजेक्ट फ़ोल्डर लिंक हो गया।

# privacyWarningTitle
source: Privacy warning
fr: Avertissement de confidentialite
hi: गोपनीयता चेतावनी

# privacyWarningContent
source: Warning: Sensitive data can be read.
fr: Avertissement : des donnees sensibles peuvent etre lues.
hi: चेतावनी: संवेदनशील डेटा पढ़ा जा सकता है।

# continueButton
source: Continue
fr: Continuer
hi: जारी रखें

# attachFilesTooltip
source: Attach files
fr: Joindre des fichiers
hi: फाइलें संलग्न करें

# aiAssistantLabel
source: AI Assistant
fr: Assistant IA
hi: AI सहायक

# welcomeBack
source: Welcome back! ðŸ‘‹
fr: Bon retour ! 👋
hi: वापस स्वागत है! 👋

# projectsOverviewSubtitle
source: Here's an overview of your active projects
fr: Voici un apercu de vos projets actifs
hi: यह आपके सक्रिय प्रोजेक्ट्स का सारांश है

# recentWorkflowsTitle
source: Recent workflows
fr: Flux recents
hi: हाल के वर्कफ़्लो

# recentWorkflowsLoading
source: Loading recent workflows...
fr: Chargement des flux recents...
hi: हाल के वर्कफ़्लो लोड हो रहे हैं...

# recentWorkflowsLoadFailed
source: Could not load recent workflows.
fr: Echec du chargement des flux recents.
hi: हाल के वर्कफ़्लो लोड नहीं हो सके।

# retryButton
source: Try again
fr: Reessayer
hi: फिर से प्रयास करें

# noRecentTasks
source: No recent tasks available.
fr: Aucune tache recente disponible.
hi: कोई हालिया कार्य उपलब्ध नहीं।

source: Unknown project
fr: Projet inconnu
hi: अज्ञात प्रोजेक्ट

# projectTaskStatusSemantics
source: Project {projectName}, task {taskTitle}, status {statusLabel}, {timeLabel}
fr: Projet {projectName}, tache {taskTitle}, statut {statusLabel}, {timeLabel}
hi: प्रोजेक्ट {projectName}, कार्य {taskTitle}, स्थिति {statusLabel}, {timeLabel}

# taskStatusSemantics
source: Task {taskTitle} {statusLabel}
fr: Tache {taskTitle} {statusLabel}
hi: कार्य {taskTitle} {statusLabel}

# timeJustNow
source: Just now
fr: A l'instant
hi: अभी

# timeMinutesAgo
source: {minutes} min ago
fr: Il y a {minutes} min
hi: {minutes} मिनट पहले

# timeHoursAgo
source: {hours} hours ago
fr: Il y a {hours} h
hi: {hours} घंटे पहले

# timeDaysAgo
source: {days} days ago
fr: Il y a {days} jours
hi: {days} दिन पहले

# timeWeeksAgo
source: {weeks} weeks ago
fr: Il y a {weeks} semaines
hi: {weeks} सप्ताह पहले

# timeMonthsAgo
source: {months} months ago
fr: Il y a {months} mois
hi: {months} महीने पहले

# projectProgressChartSemantics
source: Project progress chart for {projectName}. Completed {completedPercent} percent, pending {pendingPercent} percent.
fr: Graphique de progression pour {projectName}. Termine {completedPercent} pour cent, en attente {pendingPercent} pour cent.
hi: {projectName} के लिए प्रगति चार्ट। पूरा {completedPercent} प्रतिशत, लंबित {pendingPercent} प्रतिशत।

# progressLabel
source: Progress
fr: Progression
hi: प्रगति

# completedPercentLabel
source: Completed: {percent}%
fr: Termine : {percent}%
hi: पूरा: {percent}%

# pendingPercentLabel
source: Pending: {percent}%
fr: En attente : {percent}%
hi: लंबित: {percent}%

source: No description
fr: Aucune description
hi: कोई विवरण नहीं

# closeButton
source: Close
fr: Fermer
hi: बंद करें

# burndownProgressTitle
source: Burndown progress
fr: Progression burndown
hi: बरडाउन प्रगति

# actualProgressLabel
source: Actual progress
fr: Progression reelle
hi: वास्तविक प्रगति

# idealTrendLabel
source: Ideal trend
fr: Tendance ideale
hi: आदर्श प्रवृत्ति

# statusLabel
source: Status
fr: Statut
hi: स्थिति

# burndownChartSemantics
source: Burndown chart for {projectName}. Actual points: {actualPoints}. Ideal points: {idealPoints}.
fr: Graphique burndown pour {projectName}. Points reels : {actualPoints}. Points ideaux : {idealPoints}.
hi: {projectName} के लिए बरडाउन चार्ट। वास्तविक बिंदु: {actualPoints}। आदर्श बिंदु: {idealPoints}।

# aiChatSemanticsLabel
source: AI chat
fr: Chat IA
hi: AI चैट

# aiUsageTitle
source: AI Usage
fr: Utilisation IA
hi: AI उपयोग

# aiAssistantTitle
source: AI Project Assistant
fr: Assistant de projet IA
hi: AI प्रोजेक्ट सहायक

# clearChatTooltip
source: Clear chat
fr: Effacer le chat
hi: चैट साफ करें

# noMessagesLabel
source: No messages
fr: Aucun message
hi: कोई संदेश नहीं

# aiEmptyTitle
source: Start a conversation with the AI assistant
fr: Lancez une conversation avec l'assistant IA
hi: AI सहायक से बातचीत शुरू करें

# aiEmptySubtitle
source: For example: "Generate a plan for project: webshop"
fr: Par exemple : "Genere un plan pour le projet : boutique web"
hi: उदाहरण: "प्रोजेक्ट के लिए योजना बनाएं: वेब शॉप"

# useProjectFilesLabel
source: Use project files
fr: Utiliser les fichiers du projet
hi: प्रोजेक्ट फाइलें उपयोग करें

# typeMessageHint
source: Type a message...
fr: Tapez un message...
hi: संदेश लिखें...

# projectFilesReadFailed
source: Could not read project files.
fr: Echec de lecture des fichiers du projet.
hi: प्रोजेक्ट फाइलें पढ़ने में विफल।

# aiResponseFailedTitle
source: AI response failed
fr: Echec de la reponse IA
hi: AI उत्तर विफल

# sendMessageTooltip
source: Send message
fr: Envoyer le message
hi: संदेश भेजें

# loginMissingCredentials
source: Enter username and password.
fr: Entrez le nom d'utilisateur et le mot de passe.
hi: कृपया यूज़रनेम और पासवर्ड दर्ज करें।

# loginFailedMessage
source: Sign in failed. Check your credentials.
fr: Echec de connexion. Verifiez vos identifiants.
hi: लॉगिन विफल। कृपया अपनी जानकारी जांचें।

# registerTitle
source: Register
fr: Inscription
hi: रजिस्टर

# languageLabel
source: Language
fr: Langue
hi: भाषा

# languageSystem
source: System default
fr: Par defaut du systeme
hi: सिस्टम डिफ़ॉल्ट

# languageEnglish
source: English
fr: Anglais
hi: अंग्रेज़ी

# languageDutch
source: Dutch
fr: Neerlandais
hi: डच

# languageSpanish
source: Spanish
fr: Espagnol
hi: स्पेनिश

# languageFrench
source: French
fr: Francais
hi: फ्रेंच

# languageGerman
source: German
fr: Allemand
hi: जर्मन

# languagePortuguese
source: Portuguese
fr: Portugais
hi: पुर्तगाली

# languageItalian
source: Italian
fr: Italien
hi: इटालियन

# languageArabic
source: Arabic
fr: Arabe
hi: अरबी

# languageChinese
source: Chinese
fr: Chinois
hi: चीनी

# languageJapanese
source: Japanese
fr: Japonais
hi: जापानी

# languageKorean
source: Korean
fr: Coreen
hi: कोरियन

# languageRussian
source: Russian
fr: Russe
hi: रूसी

# languageHindi
source: Hindi
hi: हिंदी

# repeatPasswordLabel
source: Repeat password
fr: Repeter le mot de passe
hi: पासवर्ड दोबारा

# passwordRulesTitle
source: Password rules
fr: Regles du mot de passe
hi: पासवर्ड नियम

# passwordRuleMinLength
source: At least 8 characters
fr: Au moins 8 caracteres
hi: कम से कम 8 अक्षर

# passwordRuleHasLetter
source: Contains a letter
fr: Contient une lettre
hi: एक अक्षर शामिल

# passwordRuleHasDigit
source: Contains a number
fr: Contient un chiffre
hi: एक अंक शामिल

# passwordRuleMatches
source: Passwords match
fr: Les mots de passe correspondent
hi: पासवर्ड मेल खाते हैं

# registerButton
source: Register
fr: S'inscrire
hi: रजिस्टर

# registrationIssueUsernameMissing
source: username missing
fr: nom d'utilisateur manquant
hi: यूज़रनेम नहीं है

# registrationIssueMinLength
source: minimum 8 characters
fr: au moins 8 caracteres
hi: कम से कम 8 अक्षर

# registrationIssueLetter
source: at least 1 letter
fr: au moins 1 lettre
hi: कम से कम 1 अक्षर

# registrationIssueDigit
source: at least 1 number
fr: au moins 1 chiffre
hi: कम से कम 1 अंक

# registrationIssueNoMatch
source: passwords do not match
fr: les mots de passe ne correspondent pas
hi: पासवर्ड मेल नहीं खाते

# registrationFailedWithIssues
source: Registration failed: {issues}.
fr: Inscription echouee : {issues}.
hi: रजिस्ट्रेशन विफल: {issues}।

# accountCreatedMessage
source: Account created. Sign in now.
fr: Compte cree. Connectez-vous maintenant.
hi: खाता बन गया। अब लॉगिन करें।

# registerFailedMessage
source: Registration failed.
fr: Inscription echouee.
hi: रजिस्ट्रेशन विफल।

# accessDeniedMessage
source: Access denied.
fr: Accès refusé.
hi: पहुंच अस्वीकृत.

# adminPanelTitle
source: Admin panel
fr: Panneau d'administration
hi: एडमिन पैनल

# adminPanelSubtitle
source: Manage roles, groups, and permissions.
fr: Gérer les rôles, groupes et autorisations.
hi: भूमिकाएँ, समूह और अनुमतियाँ प्रबंधित करें.

# rolesTitle
source: Roles
fr: Rôles
hi: भूमिकाएँ

source: No roles found.
fr: Aucun rôle trouvé.
hi: कोई भूमिका नहीं मिली.

source: Permissions: {count}
fr: Autorisations : {count}
hi: अनुमतियाँ: {count}

# editPermissionsTooltip
source: Edit permissions
fr: Modifier les autorisations
hi: अनुमतियाँ संपादित करें

# groupsTitle
source: Groups
fr: Groupes
hi: समूह

source: No groups found.
fr: Aucun groupe trouvé.
hi: कोई समूह नहीं मिला.

# roleLabel
source: Role
fr: Rôle
hi: भूमिका

# groupAddTitle
source: Add group
fr: Ajouter un groupe
hi: समूह जोड़ें

# groupNameLabel
source: Group name
fr: Nom du groupe
hi: समूह का नाम

# groupLabel
source: Group
fr: Groupe
hi: समूह

# addGroupMemberTitle
source: Add member to {groupName}
fr: Ajouter un membre à {groupName}
hi: {groupName} में सदस्य जोड़ें

# addGroupMemberTooltip
source: Add member
fr: Ajouter un membre
hi: सदस्य जोड़ें

# groupMembersTitle
source: Group members: {groupName}
fr: Membres du groupe : {groupName}
hi: समूह के सदस्य: {groupName}

source: No group members.
fr: Aucun membre dans le groupe.
hi: समूह में कोई सदस्य नहीं है.

# removeGroupMemberTooltip
source: Remove member
fr: Retirer le membre
hi: सदस्य हटाएँ

# roleCreateTitle
source: Create role
fr: Créer un rôle
hi: भूमिका बनाएँ

# roleNameLabel
source: Role name
fr: Nom du rôle
hi: भूमिका का नाम

# permissionsTitle
source: Permissions
fr: Autorisations
hi: अनुमतियाँ

# settingsBackupTitle
source: Create backup
fr: Créer une sauvegarde
hi: बैकअप बनाएं

# settingsBackupSubtitle
source: Save a local backup of Hive data.
fr: Enregistrer une sauvegarde locale des données Hive.
hi: हाइव डेटा का स्थानीय बैकअप सहेजें.

# settingsRestoreTitle
source: Restore backup
fr: Restaurer une sauvegarde
hi: बैकअप पुनर्स्थापित करें

# settingsRestoreSubtitle
source: Replace local data with a backup file.
fr: Remplacer les données locales par un fichier de sauvegarde.
hi: स्थानीय डेटा को बैकअप फ़ाइल से बदलें.

# backupSuccessMessage
source: Backup saved: {path}
fr: Sauvegarde enregistrée : {path}
hi: बैकअप सहेजा गया: {path}

# backupFailedMessage
source: Backup failed: {error}
fr: Échec de la sauvegarde : {error}
hi: बैकअप असफल: {error}

# restoreSuccessMessage
source: Backup restored. Restart the app to reload data.
fr: Sauvegarde restaurée. Redémarrez l'app pour recharger les données.
hi: बैकअप पुनर्स्थापित हो गया। डेटा लोड करने के लिए ऐप रीस्टार्ट करें.

# restoreFailedMessage
source: Restore failed: {error}
fr: Échec de la restauration : {error}
hi: पुनर्स्थापना असफल: {error}

# restoreConfirmTitle
source: Restore backup?
fr: Restaurer la sauvegarde ?
hi: बैकअप पुनर्स्थापित करें?

# restoreConfirmContent
source: This will overwrite your local data.
fr: Cela remplacera les données locales.
hi: इससे स्थानीय डेटा ओवरराइट होगा.

# restoreConfirmButton
source: Restore
fr: Restaurer
hi: पुनर्स्थापित करें

# settingsBackupLastRunLabel
source: Last backup
fr: Dernière sauvegarde
hi: अंतिम बैकअप

# backupNeverMessage
source: Never
fr: Jamais
hi: कभी नहीं

# backupNowButton
source: Backup now
fr: Sauvegarder maintenant
hi: अब बैकअप करें

# settingsBackupPathLabel
source: Backup file
fr: Fichier de sauvegarde
hi: बैकअप फ़ाइल

# backupNoFileMessage
source: No backup file yet
fr: Aucun fichier de sauvegarde pour l'instant
hi: अभी कोई बैकअप फ़ाइल नहीं है
